Revit 2027 API
Space.NumberofPeople Property
Get or set the Number of People of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NumberofPeople { get; set; }
Public Property NumberofPeople As Double
	Get
	Set
public:
property double NumberofPeople {
	double get ();
	void set (double value);
}
member NumberofPeople : float with get, set
Property Value
Double
Remarks
This property is used to get or set Number of People of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace